---
kind: other
id: Methods.T:Autodesk.Revit.DB.SharedParameterElement
source: html/af935fa1-2079-8643-b011-2d018c28f037.htm
---
# SharedParameterElement Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.